app/controllers/locations_controller.rb

  def specific

    building = params[:building]
    room = params[:room]

    if (room == nil)
      office = building;
      @location = Campus.find_by_name(building)

    else
      case building
        when "ED.I"
          @location = Edi.find_by_name(room)
        when "ED.II"
          @location = Edii.find_by_name(room)
        when "ED.III"
          @location = Ediii.find_by_name(room)
---
SELECT `campus`.* FROM `campus` WHERE `campus`.`name` = 'Ed.I' LIMIT 1
SELECT `edis`.* FROM `edis` WHERE `edis`.`name` = '209A' LIMIT 1
SELECT `ediis`.* FROM `ediis` WHERE `ediis`.`name` = '128' LIMIT 1
SELECT `ediiis`.* FROM `ediiis` WHERE `ediiis`.`name` = 'IS-Ed.III-0-D2' LIMIT 1